app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Snow Jr"], ["updated_at", "2020-12-16 19:05:05.504245"], ["id", 7]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(student_params)